{
    "books": [
        {
            "id": 1,
            "title": "A Game of Thrones",
            "image": "https://m.media-amazon.com/images/I/51tl4a3VY8L._SX328_BO1,204,203,200_.jpg",
            "author": "George R. R. Martin",
            "pageCount": 720,
            "summary": "Winter is coming. Such is the stern motto of House Stark, the northernmost of the fiefdoms that owe allegiance to King Robert Baratheon in far-off King’s Landing. There Eddard Stark of Winterfell rules in Robert's name. There his family dwells in peace and comfort: his proud wife, Catelyn; his sons Robb, Brandon, and Rickon; his daughters Sansa and Arya; and his bastard son, Jon Snow. Far to the north, behind the towering Wall, lie savage Wildings and worse—unnatural things relegated to myth during the centuries-long summer, but proving all too real and all too deadly in the turning of the season.",
            "link": "https://www.amazon.com/Game-Thrones-Song-Fire-Book/dp/0553386794/ref=tmm_pap_swatch_0?_encoding=UTF8&qid=1675276322&sr=1-3" 
        }, 
        {
            "id": 2,
            "title": "A Clash of Kings",
            "image": "https://m.media-amazon.com/images/I/51bkBIA1gEL._SX330_BO1,204,203,200_.jpg",
            "author": "George R. R. Martin",
            "pageCount": 784,
            "summary": "A comet the color of blood and flame cuts across the sky. And from the ancient citadel of Dragonstone to the forbidding shores of Winterfell, chaos reigns. Six factions struggle for control of a divided land and the Iron Throne of the Seven Kingdoms, preparing to stake their claims through tempest, turmoil, and war. It is a tale in which brother plots against brother and the dead rise to walk in the night. Here a princess masquerades as an orphan boy; a knight of the mind prepares a poison for a treacherous sorceress; and wild men descend from the Mountains of the Moon to ravage the countryside. Against a backdrop of incest and fratricide, alchemy and murder, victory may go to the men and women possessed of the coldest steel . . . and the coldest hearts. For when kings clash, the whole land trembles.",
            "link": "https://www.amazon.com/Clash-Kings-HBO-Tie-Song/dp/0345535413/ref=sxin_10_mbs_w_global_sims?content-id=amzn1.sym.f6adc278-60fd-4516-8b02-0dbae28f44f1%3Aamzn1.sym.f6adc278-60fd-4516-8b02-0dbae28f44f1&crid=CXNXZFB4ZNV5&cv_ct_cx=a+game+of+thrones+book&keywords=a+game+of+thrones+book&pd_rd_i=0345535413&pd_rd_r=aab59dd0-f987-42f4-8bc1-ceaf4d7b2822&pd_rd_w=ykU4z&pd_rd_wg=0vrCB&pf_rd_p=f6adc278-60fd-4516-8b02-0dbae28f44f1&pf_rd_r=TXT2NZYTX6G2EEJXTMQN&qid=1675277237&s=books&sprefix=a+game+of+thrones+book+%2Cstripbooks%2C617&sr=1-1-9e7645f9-2d19-4bff-863e-f6cdbe50f990" 
        }, 
        {
            "id": 3,
            "title": "A Storm of Swords",
            "image": "https://m.media-amazon.com/images/I/51yh24jlQpL._SX324_BO1,204,203,200_.jpg",
            "author": "George R. R. Martin",
            "pageCount": 1008,
            "summary": "Of the five contenders for power, one is dead, another in disfavor, and still the wars rage as violently as ever, as alliances are made and broken. Joffrey, of House Lannister, sits on the Iron Throne, the uneasy ruler of the land of the Seven Kingdoms. His most bitter rival, Lord Stannis, stands defeated and disgraced, the victim of the jealous sorceress who holds him in her evil thrall. But young Robb, of House Stark, still rules the North from the fortress of Riverrun. Robb plots against his despised Lannister enemies, even as they hold his sister hostage at King's Landing, the seat of the Iron Throne. Meanwhile, making her way across a blood-drenched continent is the exiled queen, Daenerys, mistress of the only three dragons still left in the world. . . .",
            "link": "https://www.amazon.com/Storm-Swords-Song-Fire-Three/dp/0553381709/ref=sxin_10_mbs_w_global_sims?content-id=amzn1.sym.f6adc278-60fd-4516-8b02-0dbae28f44f1%3Aamzn1.sym.f6adc278-60fd-4516-8b02-0dbae28f44f1&crid=CXNXZFB4ZNV5&cv_ct_cx=a+game+of+thrones+book&keywords=a+game+of+thrones+book&pd_rd_i=0553381709&pd_rd_r=aab59dd0-f987-42f4-8bc1-ceaf4d7b2822&pd_rd_w=ykU4z&pd_rd_wg=0vrCB&pf_rd_p=f6adc278-60fd-4516-8b02-0dbae28f44f1&pf_rd_r=TXT2NZYTX6G2EEJXTMQN&qid=1675277237&s=books&sprefix=a+game+of+thrones+book+%2Cstripbooks%2C617&sr=1-2-9e7645f9-2d19-4bff-863e-f6cdbe50f990" 
        }, 
        {
            "id": 4,
            "title": "Harry Potter and the Sorcerer's Stone",
            "image": "https://m.media-amazon.com/images/I/51HSkTKlauL._SX346_BO1,204,203,200_.jpg",
            "author": "J.K Rowling",
            "pageCount": 309,
            "summary": "Harry Potter has no idea how famous he is. That's because he's being raised by his miserable aunt and uncle who are terrified Harry will learn that he's really a wizard, just as his parents were. But everything changes when Harry is summoned to attend an infamous school for wizards, and he begins to discover some clues about his illustrious birthright. From the surprising way he is greeted by a lovable giant, to the unique curriculum and colorful faculty at his unusual school, Harry finds himself drawn deep inside a mystical world he never knew existed and closer to his own noble destiny.",
            "link": "https://www.amazon.com/Harry-Potter-Sorcerers-Stone-Rowling/dp/059035342X/ref=sr_1_1?keywords=harry+potter+book+1+paperback&qid=1675278057&s=books&sprefix=harry+potter+book+paper%2Cstripbooks%2C268&sr=1-1" 
        }, 
        {
            "id": 5,
            "title": "Harry Potter and the Chamber of Secrets",
            "image": "https://m.media-amazon.com/images/I/51mFoFmu0EL._SX335_BO1,204,203,200_.jpg",
            "author": "J.K Rowling",
            "pageCount": 341,
            "summary": "The Dursleys were so mean that hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike. And strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor, Gilderoy Lockheart, a spirit named Moaning Myrtle who haunts the girls' bathroom, and the unwanted attentions of Ron Weasley's younger sister, Ginny. But each of these seem minor annoyances when the real trouble begins, and someone--or something--starts turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects...Harry Potter himself?",
            "link": "https://www.amazon.com/Harry-Potter-Chamber-Secrets-Rowling/dp/0439064872/ref=sr_1_1?crid=EPA5GN3PTE08&keywords=harry+potter+book+2+paperback&qid=1675278526&s=books&sprefix=harry+potter+book+2+paperback%2Cstripbooks%2C124&sr=1-1" 
        },
        {
            "id": 6,
            "title": "The 7 Habits of Highly Effective People",
            "image": "https://m.media-amazon.com/images/I/41f3shLJf5L._SX326_BO1,204,203,200_.jpg",
            "author": "Stephen R. Covey",
            "pageCount": 464,
            "summary": "This beloved classic presents a principle-centered approach for solving both personal and professional problems. With penetrating insights and practical anecdotes, Stephen R. Covey reveals a step-by-step pathway for living with fairness, integrity, honesty, and human dignity—principles that give us the security to adapt to change and the wisdom and power to take advantage of the opportunities that change creates.",
            "link": "https://www.amazon.com/Habits-Highly-Effective-People-Powerful/dp/1982137274/ref=sr_1_1?keywords=7+habits+of+highly+successful+people&qid=1675278722&s=books&sprefix=7+habi%2Cstripbooks%2C128&sr=1-1" 
        }, 
        {
            "id": 7,
            "title": "Cracking the Coding Interview",
            "image": "https://m.media-amazon.com/images/I/410hiaPGyCL._SX348_BO1,204,203,200_.jpg",
            "author": "Gayle Laakmann McDowell",
            "pageCount": 687,
            "summary": "I am not a recruiter. I am a software engineer. And as such, I know what it's like to be asked to whip up brilliant algorithms on the spot and then write flawless code on a whiteboard. I've been through this as a candidate and as an interviewer. Cracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book.",
            "link": "https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/ref=sr_1_1?keywords=cracking+the+coding+interview+2022&qid=1675278807&s=books&sprefix=cracking+the+%2Cstripbooks%2C137&sr=1-1" 
        }, 
        {
            "id": 8,
            "title": "",
            "image": "",
            "author": "",
            "pageCount": 0,
            "summary": "",
            "link": "" 
        }, 
        {
            "id": 9,
            "title": "",
            "image": "",
            "author": "",
            "pageCount": 0,
            "summary": "",
            "link": "" 
        }, 
        {
            "id": 10,
            "title": "",
            "image": "",
            "author": "",
            "pageCount": 0,
            "summary": "",
            "link": "" 
        }
    ]
}